import { Vortex } from "@/components/velora/vortex";

export default function VortexDemo() {
    return (
        <section className="w-full min-h-svh grid place-content-center bg-background overflow-hidden rounded-lg  text-center">
            <Vortex className="text-foreground" />
            <h1 className="text-3xl font-semibold ">آشنایی با پس زمینه ورتکس</h1>
            <div className="max-w-3xl">
                <p className="text-sm font-semibold my-2">خبرگزاری یمنی: عربستان از چین خواسته رسماً میانجی‌گری با یمن را برای اعلام آتش‌بس، بر عهده بگیرد. یمن هم گفته پیش از اعلام هرگونه آتش‌بس، ریاض باید تعهدات مربوط به روند صلح را اجرا کند.</p>
                <p className="text-sm font-semibold  my-2">
                    به گزارش تابناک؛ خبرگزاری یمنی YNP در گزارشی اختصاصی نوشت که منابع آگاه اعلام کرده‌اند عربستان سعودی از دولت چین خواسته است به‌طور رسمی میانجیگری با صنعا را برای اعلام آتش‌بس میان دو طرف بر عهده بگیرد.
                </p>
                <p className="text-sm font-semibold  my-2">
                    خبرگزاری یمنی YNP در گزارشی اختصاصی نوشت که منابع آگاه اعلام کرده‌اند عربستان سعودی از دولت چین خواسته است به‌طور رسمی میانجیگری با صنعا را برای اعلام آتش‌بس میان دو طرف بر عهده بگیرد.
                </p>
                <p className="text-sm font-semibold  my-2">
                    بنا بر این گزارس؛ این منابع افزودند که ریاض به پکن اطلاع داده است آمادگی دارد با برقراری آتش‌بس با صنعا در یمن موافقت کند؛ آتش‌بسی که توقف عملیات نظامی، از جمله حملات هوایی، را دربرمی‌گیرد.
                </p>
                <p className="text-sm font-semibold  my-2">
                    به گفته این منابع، صنعا نیز اعلام کرده است که پیش از اعلام هرگونه آتش‌بس، عربستان سعودی باید تعهدات مربوط به روند صلح را اجرا کند.
                </p>
                 <p className="text-sm font-semibold  my-2">
                     سرگی لاوروف وزیرامورخارجه در حاشیه اجلاس در ترکمنستان توجه اش به پیکسل روی کت سید عباس عراقچی جلب می شود و به آن اشاره می کند و سپس به وزیر خارجه به مزاح گفت: «پس آن سه جزیره کو؟» که با جواب معنادار عراقچی روبه‌رو می شود، عراقچی به قلب خود اشاره می کند و می گوید: «آن سه جزیره اینجا هستند!»
                 </p>
            </div>
        </section>

    );
}