import { DotPattern, GridPattern } from "@/components/velora/grid-pattern";

export default function BGPage() {
    return (
        <section className="relative flex min-h-80 w-full items-center justify-center overflow-hidden rounded-xl border bg-background">
            <GridPattern
                width={40}
                height={40}
                squares={[
                    [1, 1],
                    [4, 2],
                    [2, 5],
                    [6, 4],
                    [3, 7],
                ]}
                className="fill-brand/10 stroke-border mask-[linear-gradient(to_right,black_35%,transparent_65%)]"
            />
            <DotPattern
                width={16}
                height={16}
                className="fill-muted-foreground/40 mask-[linear-gradient(to_right,transparent_35%,black_65%)]"
            />
            <div className="relative px-6 text-center">
                <h2 className="mt-2 text-3xl font-semibold tracking-tight text-balance">
                    این متن برای آزمایش است
                </h2>
                <p className="text-sm font-medium text-muted-foreground">
                    الگوی شبکه مانند نقاط
                </p>
                <div className="w-2xl">
                    <p className="text-sm font-medium text-muted-foreground ">
                        وزیر دفاع عربستان سعودی اعلام کرد کمیته سیاسی و دفاعی راهبردی «ائتلاف مکه» جدید ــ که با مشارکت ترکیه و پاکستان تشکیل شده است ــ روز دوشنبه با فعال‌سازی «اقدامات بازدارندگی جمعی» در واکنش به حملات انصارالله به عربستان موافقت کرده است.
                    </p>
                    <figure className="flex justify-center py-8">
                        <img src="/assets/images/makka.webp" alt="mekka" className="object-cover" />
                    </figure>
                    <p>وزیر دفاع عربستان سعودی اعلام کرد کمیته سیاسی و دفاعی راهبردی «ائتلاف مکه» جدید ــ که با مشارکت ترکیه و پاکستان تشکیل شده است ــ روز دوشنبه با فعال‌سازی «اقدامات بازدارندگی جمعی» در واکنش به حملات انصارالله به عربستان موافقت کرده است.

                        به گزارش «انتخاب»؛ خالد بن سلمان، وزیر دفاع عربستان، در شبکه اجتماعی ایکس نوشت: «این کمیته با فعال‌سازی اقدامات بازدارندگی جمعی در چارچوب ائتلاف، در واکنش به حملات و تمامی مسئولان آن‌ها موافقت کرد.» او افزود این تصمیم در جریان یک نشست اضطراری اتخاذ شده است.

                        به گفته بن سلمان، این کمیته همچنین با عربستان سعودی در برابر «حملات» علیه این کشور اعلام همبستگی کرد.
                        تبلیغ
                        ★★★★★
                        اپلیکیشن
                        150 هزار تومان هدیه دعوت بلو
                        نصب و دعوت
                        لینک کوتاه
                        https://www.entekhab.ir/003x8J
                        مطالب پیشنهادی از سراسر وب

                        اخذ جواز کسب فوری 02152712
                        ثبت برند ویژه و فوری 02152712
                        کچلی کلا درمان شد! راز رویش مجدد مو کشف شد 🌱
                        کچلی کلا درمان شد! راز رویش مجدد مو کشف شد 🌱
                        ثبت شرکت فوری خارج از نوبت 02152712
                        فرصت محدود خرید نرم‌افزار حسابداری هوفر با 20٪ تخفیف
                        ارسال به تلگرام

                        مطالب پیشنهادی از سراسر وب



                        فرصت محدود خرید نرم‌افزار حسابداری هوفر با 20٪ تخفیف
                        فرصت محدود خرید نرم‌افزار حسابداری هوفر با 20٪ تخفیف

                        مشاهده
                        ثبت شرکت فوری خارج از نوبت 02152712
                        ثبت شرکت فوری خارج از نوبت 02152712

                        تماس با ما


                        بازید از صفحه اول ارسال به دوستان نسخه چاپی گزارش خطا1
                        مطالب پیشنهادی

                        انواع لوله را از صاحب‌بار بخرید؛ پیوان
                        از هر کارخانه، در هر ضخامت؛ ورق گالوانیزه را از پیوان بخواهید
                        پیوان؛ خرید فولاد از صاحب بار
                        فرصت محدود خرید نرم‌افزار حسابداری هوفر با 20٪ تخفیف
                        بمب خبری: اختراع جنجالی پزشک شیرازی به جای کاشت مو! 🤯
                        بمب خبری: اختراع جنجالی پزشک شیرازی به جای کاشت مو! 🤯
                        پنجره
                        ثبت کسب و کار
                        دیده شدن بیشتر

                        کل ایران

                        همه

                        املاک

                        وسایل نقلیه

                        کالای دیجیتال

                        خانه و آشپزخانه

                        خدمات

                        وسایل شخصی

                        سرگرمی و فراغت

                        اجتماعی

                        تجهیزات و صنعتی

                        استخدام
                        کفی خودروبر شبانه‌روزی در تهران؛ ایمن، بیمه‌شده و سریع؛ اعلام هزینه
                        آسانسور شده

                        کامپیوتر بلد نیستی؟ از صفر شروع کن!

                        رتبه همه‌چیز نیست؛ انتخاب رشته درست می‌تواند آینده‌ات را تغییر دهد.

                        فیش حج عمره وتمتع خرید وفروش فیش حج عمره وتمتع در سراسر کشور
                        آسانسور شده

                        قبل از خرید بیمه، قیمت چند سایت رو در آسان‌بیمه مقایسه کن.

                        تولید کارت کلکسیونی ماینکرفت و کالاف، لگو ۱۰۰ تکه | ویژه پخش‌کنندگان

                        مالکیت ویلای مبله در ۳۰ شهر((دهکده پاستیلی پلاس))
                        آسانسور شده

                        🚨هنوز اجاره میدی؟ اقساطی در تهران صاحب‌خونه شو🏠
                        آسانسور شده

                        فروش اقساطی 0912

                        🦷کامپوزیت دندان🦷✨ ۵۰٪ تخفیف بلیط رفت وبرگشت از هر جای ایران
                        آسانسور شده

                        اگر بودجه نامحدود برای تبلیغ کسب‌وکارت داری کلیک نکن!

                        🔥 خرید عمده سوپرمارکتی با تخفیف ویژه و ارسال فوری در تهران
                        آسانسور شده

                        واریس داری؟ ۸ میلیون تومان تخفیف درمان تا آخر هفته 💯 با مشاوره رایگان

                        کیف پاور استیشن ۵ کیلووات؛ برق قدرتمند، مطمئن و قابل‌حمل، همیشه همراه!
                        آسانسور شده

                        انواع نژاد و قیمت جوجه یکروزه را مقایسه و مستقیم از مرغ مادر خرید کنید

                        🎵آهنگ خودتو بساز فقط در ۳۰ ثانیهثبت‌نام کن و اولین موزیکت مهمون ما🎁
                        آسانسور شده

                        ایمپلنت کره ایی با ضمانت مادام العمر 💯 فقط ۹/۹۰۰ با شرایط اقساط

                        🔥 درمان دندان با شرایط اقساطی | طرف قرارداد با بیمه‌ها
                        آسانسور شده

                        اجرا میکروسمنت کف | نما | سرویس و ...
                        قیمت منصفانه با متریال با...
                        آسانسور شده

                        وقتشه ems رو به باشگاهت اضافه کنی !!!!
                        با گارانتی بی قید و شرط
                        آسانسور شده

                        کفی خودروبر شبانه‌روزی در تهران؛ ایمن، بیمه‌شده و سریع؛ اعلام هزینه
                        آسانسور شده
                        کفی خودروبر شبانه‌روزی در تهران؛ ایمن، بیمه‌شده و سریع؛ اعلام هزینه

                        کامپیوتر بلد نیستی؟ از صفر شروع کن!
                        کامپیوتر بلد نیستی؟ از صفر شروع کن!

                        رتبه همه‌چیز نیست؛ انتخاب رشته درست می‌تواند آینده‌ات را تغییر دهد.
                        رتبه همه‌چیز نیست؛ انتخاب رشته درست می‌تواند آینده‌ات را تغییر دهد.

                        فیش حج عمره وتمتع خرید وفروش فیش حج عمره وتمتع در سراسر کشور
                        آسانسور شده
                        فیش حج عمره وتمتع خرید وفروش فیش حج عمره وتمتع در سراسر کشور

                        قبل از خرید بیمه، قیمت چند سایت رو در آسان‌بیمه مقایسه کن.
                        قبل از خرید بیمه، قیمت چند سایت رو در آسان‌بیمه مقایسه کن.

                        تولید کارت کلکسیونی ماینکرفت و کالاف، لگو ۱۰۰ تکه | ویژه پخش‌کنندگان
                        تولید کارت کلکسیونی ماینکرفت و کالاف، لگو ۱۰۰ تکه | ویژه پخش‌کنندگان

                        مالکیت ویلای مبله در ۳۰ شهر((دهکده پاستیلی پلاس))
                        آسانسور شده
                        مالکیت ویلای مبله در ۳۰ شهر((دهکده پاستیلی پلاس))

                        🚨هنوز اجاره میدی؟ اقساطی در تهران صاحب‌خونه شو🏠
                        آسانسور شده
                        🚨هنوز اجاره میدی؟ اقساطی در تهران صاحب‌خونه شو🏠

                        فروش اقساطی 0912
                        فروش اقساطی 0912

                        🦷کامپوزیت دندان🦷✨ ۵۰٪ تخفیف بلیط رفت وبرگشت از هر جای ایران
                        آسانسور شده
                        🦷کامپوزیت دندان🦷✨ ۵۰٪ تخفیف بلیط رفت وبرگشت از هر جای ایران

                        اگر بودجه نامحدود برای تبلیغ کسب‌وکارت داری کلیک نکن!
                        اگر بودجه نامحدود برای تبلیغ کسب‌وکارت داری کلیک نکن!

                        🔥 خرید عمده سوپرمارکتی با تخفیف ویژه و ارسال فوری در تهران
                        آسانسور شده
                        🔥 خرید عمده سوپرمارکتی با تخفیف ویژه و ارسال فوری در تهران

                        واریس داری؟ ۸ میلیون تومان تخفیف درمان تا آخر هفته 💯 با مشاوره رایگان
                        واریس داری؟ ۸ میلیون تومان تخفیف درمان تا آخر هفته 💯 با مشاوره رایگان

                        کیف پاور استیشن ۵ کیلووات؛ برق قدرتمند، مطمئن و قابل‌حمل، همیشه همراه!
                        آسانسور شده
                        کیف پاور استیشن ۵ کیلووات؛ برق قدرتمند، مطمئن و قابل‌حمل، همیشه همراه!

                        انواع نژاد و قیمت جوجه یکروزه را مقایسه و مستقیم از مرغ مادر خرید کنید
                        انواع نژاد و قیمت جوجه یکروزه را مقایسه و مستقیم از مرغ مادر خرید کنید

                        🎵آهنگ خودتو بساز فقط در ۳۰ ثانیهثبت‌نام کن و اولین موزیکت مهمون ما🎁
                        آسانسور شده
                        🎵آهنگ خودتو بساز فقط در ۳۰ ثانیهثبت‌نام کن و اولین موزیکت مهمون ما🎁

                        ایمپلنت کره ایی با ضمانت مادام العمر 💯 فقط ۹/۹۰۰ با شرایط اقساط
                        ایمپلنت کره ایی با ضمانت مادام العمر 💯 فقط ۹/۹۰۰ با شرایط اقساط

                        🔥 درمان دندان با شرایط اقساطی | طرف قرارداد با بیمه‌ها
                        آسانسور شده
                        🔥 درمان دندان با شرایط اقساطی | طرف قرارداد با بیمه‌ها

                        اجرا میکروسمنت کف | نما | سرویس و ...
                        قیمت منصفانه با متریال با...
                        آسانسور شده
                        اجرا میکروسمنت کف | نما | سرویس و ... قیمت منصفانه با متریال با...

                        وقتشه ems رو به باشگاهت اضافه کنی !!!!
                        با گارانتی بی قید و شرط
                        آسانسور شده
                        وقتشه ems رو به باشگاهت اضافه کنی !!!! با گارانتی بی قید و شرط

                        کفی خودروبر شبانه‌روزی در تهران؛ ایمن، بیمه‌شده و سریع؛ اعلام هزینه
                        آسانسور شده

                        کامپیوتر بلد نیستی؟ از صفر شروع کن!

                        رتبه همه‌چیز نیست؛ انتخاب رشته درست می‌تواند آینده‌ات را تغییر دهد.

                        فیش حج عمره وتمتع خرید وفروش فیش حج عمره وتمتع در سراسر کشور
                        آسانسور شده

                        قبل از خرید بیمه، قیمت چند سایت رو در آسان‌بیمه مقایسه کن.

                        تولید کارت کلکسیونی ماینکرفت و کالاف، لگو ۱۰۰ تکه | ویژه پخش‌کنندگان

                        مالکیت ویلای مبله در ۳۰ شهر((دهکده پاستیلی پلاس))
                        آسانسور شده

                        🚨هنوز اجاره میدی؟ اقساطی در تهران صاحب‌خونه شو🏠
                        آسانسور شده

                        فروش اقساطی 0912

                        🦷کامپوزیت دندان🦷✨ ۵۰٪ تخفیف بلیط رفت وبرگشت از هر جای ایران
                        آسانسور شده

                        اگر بودجه نامحدود برای تبلیغ کسب‌وکارت داری کلیک نکن!

                        🔥 خرید عمده سوپرمارکتی با تخفیف ویژه و ارسال فوری در تهران
                        آسانسور شده

                        واریس داری؟ ۸ میلیون تومان تخفیف درمان تا آخر هفته 💯 با مشاوره رایگان

                        کیف پاور استیشن ۵ کیلووات؛ برق قدرتمند، مطمئن و قابل‌حمل، همیشه همراه!
                        آسانسور شده

                        انواع نژاد و قیمت جوجه یکروزه را مقایسه و مستقیم از مرغ مادر خرید کنید

                        🎵آهنگ خودتو بساز فقط در ۳۰ ثانیهثبت‌نام کن و اولین موزیکت مهمون ما🎁
                        آسانسور شده

                        ایمپلنت کره ایی با ضمانت مادام العمر 💯 فقط ۹/۹۰۰ با شرایط اقساط

                        🔥 درمان دندان با شرایط اقساطی | طرف قرارداد با بیمه‌ها
                        آسانسور شده

                        اجرا میکروسمنت کف | نما | سرویس و ...
                        قیمت منصفانه با متریال با...
                        آسانسور شده

                        وقتشه ems رو به باشگاهت اضافه کنی !!!!
                        با گارانتی بی قید و شرط
                        آسانسور شده

                        نمایش بیشتر
                        مطالب پیشنهادی

                        اخذ جواز کسب فوری 02152712
                        ثبت برند ویژه و فوری 02152712
                        این قرص، مفصل‌دردمو نجات داد!!!
                        این قرص، مفصل‌دردمو نجات داد!!!
                        خداحافظی با زانو درد!!
                        فرصت محدود خرید نرم‌افزار حسابداری هوفر با 20٪ تخفیف
                        نظرات بینندگان
                        نام
                        نام
                        ایمیل
                        ایمیل
                        * نظر
                        نظر

                        * کد امنیتی
                        کد امنیتی
                        captcha

                        تصاویر۳/۴
                        تصاویر: مراسم تشییع «طارق نیک‌پور»، نوازنده گروه تئاتر «تی‌توک» - بندرعباس
                        تصاویر: مراسم تشییع «طارق نیک‌پور»، نوازنده گروه تئاتر «تی‌توک» - بندرعباس
                        تصاویر: دیدار وزیر امور خارجه ارمنستان با عراقچی
                        تصاویر: دیدار وزیر امور خارجه ارمنستان با عراقچی
                        تصاویر: بازداشت سارق منزل سفیر فیلیپین
                        تصاویر: بازداشت سارق منزل سفیر فیلیپین
                        تصاویر: مراسم ختم خواهر عراقچی، وزیر خارجه
                        تصاویر: مراسم ختم خواهر عراقچی، وزیر خارجه


                        پیشنهاد امروز



                        💸فرصت ویژه برای رشد فروش! 15 روز CRM دیدار رایگان
                        💸فرصت ویژه برای رشد فروش! 15 روز CRM دیدار رایگان

                        💸فرصت ویژه برای رشد فروش! 15 روز CRM دیدار رایگان
                        💸فرصت ویژه برای رشد فروش! 15 روز CRM دیدار رایگان




                        پربازدیدها
                        روزهفتهماهسال
                        آقامیری، رئیس مرکز ملی فضای مجازی: برای اولین بار توانستیم پایانه‌های استارلینک را در جریانات دی ماه سال گذشته از کار بیندازیم / در شرایط جنگی استارلینک هدف مشروع نظامی است
                        اکسیوس: در دیدار محرمانه دستیاران ارشد امنیت ملی ترامپ در کمپ دیوید درباره ایران، ونس، روبیو، هگست، ویتکاف، جان رتکلیف، رئیس سیا، ژنرال دن کین و بنست حضور داشتند/ ریاست این نشست را جی‌دی ونس بر عهده داشت / در این نشست درباره برخی مسائل خاورمیانه تصمیم‌گیری شد
                        معلوم نیست این جنگ چند سال طول بکشد؛ باید برای تداوم آن آماده باشیم/هیچ عجله‌ای نداریم که همه‌ دارایی‌های خودمان را همین حالا شلیک کنیم /گاهی درباره موشک‌های قاره‌پیما صحبت می‌شود؛ حضرت آقا اجازه ندادند و فرمودند همین برد ۲ هزار کیلومتری را داشته باشید؛ اکنون نیز با همین توان کار می‌کنیم/لازمه عبور از شرایط امروز آن است که نیروهای خودی را در خط دشمن فرض نکنیم
                        ویدیو / زیدآبادی در مناظره با مهدی جمشیدی: جبهه پایداری دنبال پیاده‌سازی مدل کره شمالی در ایران است یعنی یک کشور منزوی شده از جهان که سلاح هسته ای هم داشته باشد، با یک  نظام اقتصادی شبه کمونیستی و تلاش برای تحمیل سبک زندگی خود به دیگران به عنوان تنها راه سعادت آمیز
                        یک روز پس از اعلام آغاز عملیات نظامی دولت مورد حمایت سعودی در یمن علیه انصارالله؛ مقام‌های ارشد عربستان، ترکیه و پاکستان در ریاض گرد هم آمدند
                        ویدیو / قادری کنگاوری، استاد روابط بین‌الملل دانشگاه امام حسین: سفیر سابق روسیه در ایران گفته بود «تا مشکلی برای ایرانی ها ایجاد نکنی، مشکلت را حل نمی‌کند»، من هم می‌گویم نظام بین‌الملل هم اینگونه است تا برایش مشکل ایجاد نکنی، مشکلت را حل نمی‌کند / زمانی می‌توانیم طرف مقابل را مجبور به انجام تعهداتش بکنیم که به قدرت موازنه‌بخشی برسیم
                        ببینید / رهگیری پهپاد اوکراینی با سامانه پدافند هوایی دوش پرتاب تنها چند ثانیه پیش از رسیدن به یک تأسیسات نفتی
                        ویدیو / آجرلو عضو کمیته رسانه تیم مذاکره‌کننده: آقایانی که می‌گفتند نفت ۱۵۰ دلار می‌شود، الان باید بیایند جواب بدهند / می‌گویند کاری کنیم ترامپ انتخابات کنگره را ببازد، خب ببازه، بعد چه می‌شود؟
                        نیازمندیها





                        خواندنی ها
                        تغییر شکل قرنیه با جریان برق؛ روش آزمایشی جدید اصلاح نزدیک‌بینی بدون لیزیک
                        تغییر شکل قرنیه با جریان برق؛ روش آزمایشی جدید اصلاح نزدیک‌بینی بدون لیزیک
                        تغییری ساده در رژیم غذایی علائم افسردگی را در طول چهار هفته کاهش داد
                    </p>
                </div>
            </div>
        </section>
    );
}
